class Constant {
  static const String package = 'ptt_ai_package';
  static const String appkey = 'tmm_app';
  static const String appsecret = 'tmm123321';
  static const String baseUrl = 'https://51ptt-gateway-v2.yuedaoec.com';
  static const String srcUrl = 'https://resource.51ptt.net/ptt/';

  static const Map<String, String> audioResource = {
    '谢谢您选择我们的产品，愿它为您带来持久的美丽，祝您永远保持健康与光彩！':
        'https://resource.51ptt.net/ai/tts_output/zt_20231013163853.wav',
    '感谢您购买我们的产品，希望它能让您更漂亮噢！祝您拥有美好的一天！':
        'https://resource.51ptt.net/ai/tts_output/zt_20231013163945.wav',
    '亲亲，感谢您的支持，愿我们的产品能令您焕发出独特的魅力，祝您美丽动人！':
        'https://resource.51ptt.net/ai/tts_output/zt_20231013164024.wav',
    '嗨，很高兴被你选中！非常感谢你的购买，祝你每天喜笑颜开！':
        'https://resource.51ptt.net/ai/tts_output/zt_20231013164135.wav',
    '亲爱的，感谢你为自己的美丽投资！衷心希望我们能让你每一天都光彩照人、自信满满！':
        'https://resource.51ptt.net/ai/tts_output/zt_20231013164200.wav'
  };

  static const String recordExampleText1 = '录音时，请朗读以下内容';
  static const String recordExampleText2 = '1.请保持环境安静，语音清晰';
  static const String recordExampleText3 = '2.录制声音5分钟左右，中途可以点击暂停休息调整';
  static const String recordExampleText4 =
      '在这宁静的时刻，让我们一起感受生活的美好。每个人都有自己的故事，每个故事都有自己的独特之处。我们的生活充满了各种经历，不论是快乐的还是悲伤的，都是我们人生中宝贵的财富。\n当我们回顾过去的时候，我们会发现，那些让我们感到振奋的时刻总是充满了欢乐和惊喜。而那些令我们心碎的时刻，则让我们更加珍惜现在的幸福。正是这些经历，让我们变得更加坚强和成熟。\n当我们面对困难时，我们不应该沉溺于悲伤和痛苦中。相反，我们应该勇敢地面对它们，并从中汲取力量。每一次挫折都是一次成长的机会，让我们变得更加明智和坚强。\n同时，我们也应该学会珍惜每一个瞬间。生活中每一个微小的细节都值得我们去关注和欣赏。无论是阳光普照的天气、一朵盛开的花朵、或是与朋友分享的笑声，都是我们生活中的美好瞬间。\n当我们与他人相处时，我们应该学会关爱和尊重他们。每个人都有自己的想法和感受，我们应该尝试去理解和接纳他们的不同。当我们以宽容和包容的心态去对待他人时，我们会发现，这个世界变得更加美好。\n最后，让我们一起珍惜每一个当下。过去的已经过去，未来的还未到来。我们能把握的只有现在这个瞬间。让我们用心去感受现在的美好，去发现生活中的乐趣和意义。无论我们身处何方，只要我们用心去体验和感受生活，就会发现它的美好之处。\n在这个宁静的时刻，让我们一起用心去感受生活的美好。让我们学会珍惜每一个经历、每一个瞬间、每一个人。让我们勇敢地面对困难，从中汲取力量。让我们把握现在，去发现生活的乐趣和意义。因为在这个世界上，每一个生活都是独一无二的，每一个经历都是宝贵的财富。';
  static const String recordExampleText5 = '这个宁静的午后，让我们一起漫步在时间的田野上，感受岁月如歌的韵律。在这片刻的安逸中，让我们忘却尘世的纷扰，感受生命的美好。\n每个人都有自己的时光旅程。我们在光阴的河流中漂泊，感受着生活的酸甜苦辣。时光如水，轻轻抚过我们青春的脸庞，留下了岁月的印记。在那些闪耀的日子里，我们笑过、哭过、爱过、痛过，最终成为了今天的自己。\n生命是一场奇妙的旅程。我们都在寻找属于自己的归宿。有时，我们会在人生的十字路口迷失方向；有时，我们会感叹命运的无常。但请相信，每一次跌倒都会让我们更加坚强，每一次选择都会让我们更加成熟。在风雨中，我们学会了承受；在阳光下，我们学会了坚强。\n生活中的美好总是不经意间出现。当我们在忙碌中抬头，看到一片美丽的云彩；当我们在寒风中前行，闻到一朵花的香气。那些瞬间，我们会被这个世界温柔相待。学会珍惜这些美好的瞬间，它们是生命赐予我们的礼物。\n我们要学会感恩。感恩那些陪伴我们走过风雨的人，是他们给予我们力量；感恩那些在我们困境中伸出援手的人，是他们让我们感受到温暖。同时，也要感恩那些伤害过我们的人，是他们让我们变得更加坚强。\n在生命的田野上，我们都是寻梦的孩子。我们在时光的长河中奔跑、追逐，寻找属于自己的梦想。或许路途遥远，或许困难重重，但请相信，只要我们勇往直前，终会抵达梦想的彼岸。\n最后，在这个宁静的午后，让我们一起许下一个美好的愿望。愿我们的生命如阳光般温暖、如大海般宽广、如星空般璀璨；愿我们的旅程充满欢笑与感动，成为我们宝贵的回忆。';
  static const String recordExampleText6 = '在这个宁静的午后，让我们一起漫步在春意盎然的花园里。阳光透过树叶的缝隙洒在软绵绵的草地上，空气中弥漫着青草和花朵的香气。我们听到鸟儿在枝头欢快地歌唱，还有小溪在远处潺潺流淌。\n此刻，世界仿佛放慢了脚步，只剩下我们与这美妙的自然景观相依相伴。我们感受到阳光的温暖，呼吸着清新的空气，那些繁杂的琐事和忧虑在此刻都显得微不足道。\n想象一下，如果我们能够将这种平和的心态融入到生活的每一个角落，那将会是一种怎样的美好？我们在这个快节奏的时代里奔波，常常被压力和焦虑所包围，而忘记了内心的宁静和力量。\n让我们试着放慢脚步，感受大自然的美好与恩赐。在这个充满竞争和挑战的时代里，我们需要学会珍惜当下，感恩生活中的每一份美好。无论是那一抹阳光、一阵微风，还是与亲朋好友的相聚时光，都是值得我们去珍惜和感悟的。\n当我们学会放下过去的遗憾和未来的担忧，专注于当下的美好与幸福，我们的内心就会变得更加宁静和充实。生活中的种种琐事和困难也会因为我们的这种心态而变得更加微不足道。\n在这个充满希望和挑战的时代里，让我们一起拥抱内心的宁静与力量，用平和的语气去面对生活中的每一个挑战。相信只要我们心怀感激、放慢脚步，就能发现生命中更多的美好与幸福。\n让我们一起将这份宁静与平和传递给身边的每一个人，让这个世界因我们的存在而变得更加美好。愿我们都能在这个喧嚣的世界里找到内心的宁静与力量，用温和平缓的语气去感受生命中的每一个美好瞬间。';
}
